https://towardsdatascience.com/pandas-string-operations-explained-fdfab7602fb4

In [2]:
import pandas as pd
import numpy as np

In [3]:
a=pd.Series(['Madrid','Berlin','Houston'])
a

0     Madrid
1     Berlin
2    Houston
dtype: object

In [4]:
a=pd.Series(['Madrid','Berlin','Houston'],dtype='string')
a

0     Madrid
1     Berlin
2    Houston
dtype: string

In [7]:
a=pd.Series(['Madrid','Berlin','Houston'],dtype=pd.StringDtype())
a

0     Madrid
1     Berlin
2    Houston
dtype: string

In [8]:
b=pd.Series(['Madrid','Berlin','Houston'])
b

0     Madrid
1     Berlin
2    Houston
dtype: object

In [9]:
b.astype('string')

0     Madrid
1     Berlin
2    Houston
dtype: string

In [10]:
a=pd.Series(['John','DJ','aKkK'])
a

0    John
1      DJ
2    aKkK
dtype: object

In [11]:
a.str.lower()

0    john
1      dj
2    akkk
dtype: object

In [13]:
a.str.upper()

0    JOHN
1      DJ
2    AKKK
dtype: object

In [14]:
a=pd.Series(['John   ','   DJ','aKkK   '])
a.str.strip()

0    John
1      DJ
2    aKkK
dtype: object

In [15]:
a=pd.Series(['Houston,TX','Dallas,TX','Atlanta,GA'])
a

0    Houston,TX
1     Dallas,TX
2    Atlanta,GA
dtype: object

In [16]:
a.str.split(',')

0    [Houston, TX]
1     [Dallas, TX]
2    [Atlanta, GA]
dtype: object

In [18]:
a=pd.Series(['A-AB-0-AB','B-B-AB','0-AB-B-0'])
a.str.split('-',expand=True)

   0   1   2     3
0  A  AB   0    AB
1  B   B  AB  None
2  0  AB   B     0

In [20]:
a=pd.Series(['A-AB-0-AB','B-B-AB','0-AB-B-0'])
a.str.split('-',expand=True,n=2)

   0   1     2
0  A  AB  0-AB
1  B   B    AB
2  0  AB   B-0

In [21]:
a=pd.Series(['A-AB-0-AB','B-B-AB','0-AB-B-0'])
a.str.rsplit('-',expand=True,n=2)

      0  1   2
0  A-AB  0  AB
1     B  B  AB
2  0-AB  B   0

In [24]:
a=pd.Series(['A','AB','C',np.nan,'D'])
a.str.cat(sep='-',na_rep='?')

'A-AB-C-?-D'

In [25]:
a=pd.Series(['A','aB','CB','aDE'])
a.str.startswith('a')

0    False
1     True
2    False
3     True
dtype: bool

In [28]:
a=pd.Series(['Berlin','Rome','Istanbul','New York'])
a.str.get_dummies()

   Berlin  Istanbul  New York  Rome
0       1         0         0     0
1       0         0         0     1
2       0         1         0     0
3       0         0         1     0